samples/SOAP XML/IPS/IPSUploadSummaryGet2_request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <IPSUploadSummaryGet2 xmlns="http://webservices.iress.com.au/v4/">
      <Input>
        <Header>
          <ServiceSessionKey>4b0d1401-176e-4e15-b3dd-ead032a80ba8@IDS-TEST</ServiceSessionKey>
          <RequestID>BAA6C3D2-9DC9-400E-A81B-3B6DF973E41A</RequestID>
          <Updates>false</Updates>
          <Timeout>25</Timeout>
          <PageSize>1000</PageSize>
          <WaitForResponse>true</WaitForResponse>
          <PagingBookmark />
          <PagingDirection>0</PagingDirection>
          <InputLocalizationType>0</InputLocalizationType>
          <OutputLocalizationType>0</OutputLocalizationType>
        </Header>
        <Parameters>
          <UploadDateTime>2020-11-05T20:31:51.6978812+11:00</UploadDateTime>
          <UploadID>33880</UploadID>
        </Parameters>
      </Input>
    </IPSUploadSummaryGet2>
  </soap:Body>
</soap:Envelope>